<?php
//
//$dist = 500;
//$time = 5;
//echo $speed = $dist / $time;
//
//
//
//echo '23' . '+' . 'String';
//echo 'String' . '+' . '23';
//echo 'String' . '+' . 'String';
//echo 'String' . '+' . 'String';
//echo 2n/3.'+' . 'String';
//echo 2n/3.'+'.2n / 3;
//
//
//$kurs = 30;
//$ua = 500;
//echo 'Usd: ' . $usd = $ua / $kurs;
//
// Вычислить периметр и площадь прямоугольника если вторая сторона в 4 раза
//  больше первой (первую сторону придумать самому)
//$a=2;
//$b=$a*4;
//$s=$a*$b;
//$p=2($a+$b);
//echo 'Периметр прямоугольника равна:'$p.'<br>'.
//        'Площадь прям-ка равна: '.$s;
//        
//3) Дано два числа. Вывести значение результата в логической переменной, которое
//        определяет,  отличаются ли первое от второго на 10.(ответ true или false) 
//$a=10;
//$b=23;
//$result=$a == $b;
//echo "TOTAL:". $result;



//4) Даны три числа. Найдите их среднее арифметическое, умножить его на 4 и
//        сравнить с каждым из чисел. (ответ true или false + сами числа) 
//    $z=2;
//    $x=3;
//    $c=5;
//    $arifm=($z+$x+$c)/3;
//    $arifm1*=4;
//    echo 'Arifm='.$arifm1. $v= $z==$x;
//    

    
    
//        
//5) Дано число. Увеличьте его на 30%, на 120% и сравнить среднее арифметическое
// результатов с первоначальным числом  (ответ true или false + сами числа)
//  
//$a=34;
//$proc=34/100;
//$a30=$a+($proc*30);
//$a120=$a+($proc*120); 
//$aArif=($a+$a30+$a120)/3;
//echo 'Result:'. $a1=$a==$aArif;


//6) Найти сумму квадратов  36% от первого числа и 87% от второго числа

//
//7) Дано трехзначное число. Найдите сумму его цифр ( с помощью отделения единиц,
// десятков,сотен ). Например: есть число 123, то программа должна вычислить 
// сумму цифр 1, 2, 3, т. е. 6.
    $a=array(1,2,3);
    echo "summ(a)= ". array_sum($a);
   

// 
//8) Возьмите свой вес , посчитайте с какой силой вас притягивает земля(вес умножить
// на 10 ньютон на килограмм) и с какой силой вам надо оттолкнуться от земли  
// чтобы подпрыгнуть(сила притяжения земли + X ньютон (взять любое число больше 300))
// 
//9) Вычислить массовую долю соли в 3% растворе массой 36 кг
//
//10 В сплаве 23% железа 17% олова и 60% меди . Сплав весит 571 кг . 
//Найти массовую долю каждого компонента

